OpenROAD 26Q1-2966-g29d97c45b3 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/ALU/base/2_1_floorplan.odb
read_sdc ./results/sky130hd/ALU/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
No macros found: Skipping macro_placement
Design area 5589 um^2 7% utilization.
write_db ./results/sky130hd/ALU/base/2_2_floorplan_macro.odb
Elapsed time: 0:01.06[h:]min:sec. CPU time: user 0.99 sys 0.17 (108%). Peak memory: 118416KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                1            115 d79b1f7ff1825faaba04
