OpenROAD 26Q1-2966-g29d97c45b3 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/ALU/base/2_3_floorplan_tapcell.odb
read_sdc ./results/sky130hd/ALU/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
Design area 6890 um^2 9% utilization.
write_db ./results/sky130hd/ALU/base/2_4_floorplan_pdn.odb
Elapsed time: 0:01.31[h:]min:sec. CPU time: user 1.15 sys 0.24 (105%). Peak memory: 123724KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  1            120 6cb0445b4562be3e485b
