OpenROAD 26Q1-2966-g29d97c45b3 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/ALU/base/3_1_place_gp_skip_io.odb
read_sdc ./results/sky130hd/ALU/base/2_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
place_pins -hor_layers met3 -ver_layers met2
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 1082
[INFO PPL-0002] Number of I/O             102
[INFO PPL-0003] Number of I/O w/sink      100
[INFO PPL-0004] Number of I/O w/o sink    2
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 10416.44 um.
Design area 6890 um^2 9% utilization.
write_db ./results/sky130hd/ALU/base/3_2_place_iop.odb
Elapsed time: 0:01.14[h:]min:sec. CPU time: user 1.31 sys 0.31 (141%). Peak memory: 120240KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      1            117 76deb05eacda533969cf
