OpenROAD 26Q1-2966-g29d97c45b3 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/ALU/base/3_place.odb
read_sdc ./results/sky130hd/ALU/base/3_place.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
clock_tree_synthesis -sink_clustering_enable -repair_clock_nets
[INFO CTS-0050] Root buffer is sky130_fd_sc_hd__clkbuf_16.
[INFO CTS-0051] Sink buffer is sky130_fd_sc_hd__clkbuf_16.
[INFO CTS-0052] The following clock buffers will be used for CTS:
                    sky130_fd_sc_hd__clkbuf_16
[INFO CTS-0049] Characterization buffer is sky130_fd_sc_hd__clkbuf_16.
[INFO CTS-0007] Net "clock" found for clock "clock".
[WARNING CTS-0041] Net "clock" has 0 sinks. Skipping...
[WARNING CTS-0083] No clock nets have been found.
[INFO CTS-0008] TritonCTS found 0 clock nets.
[WARNING CTS-0082] No valid clock nets in the design.
estimate_parasitics -placement
[INFO DPL-0005] Max displacement: +/- 500 sites horizontally, +/- 100 rows vertically.
Movements Summary
---------------------------------------
Total cells:                     919
Diamond Move Success:            919 (100.00%)
Diamond Move Failure:              0
Rip-up and replace Success:        0 (  0.00% of diamond failures)
Rip-up and replace Failure:        0
Total Placement Failures:          0
---------------------------------------
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL           27693.2 u
legalized HPWL          28293.0 u
delta HPWL                    2 %

estimate_parasitics -placement
Warning: master sky130_ef_sc_hd__decap_12 has signal pins but no liberty cell
repair_timing -setup_margin 0 -hold_margin 0 -repair_tns 100 -match_cell_footprint -verbose
[INFO RSZ-0100] Repair move sequence: UnbufferMove SizeUpMove SwapPinsMove BufferMove CloneMove SplitLoadMove 
[INFO RSZ-0098] No setup violations found
[INFO RSZ-0033] No hold violations found.
Warning: master sky130_ef_sc_hd__decap_12 has signal pins but no liberty cell
Error: cts.tcl, 80 child killed: illegal instruction
Elapsed time: 0:03.32[h:]min:sec. CPU time: user 3.14 sys 0.42 (107%). Peak memory: 154564KB.
