OpenROAD 26Q1-2966-g29d97c45b3 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/sky130hd/lef/sky130_fd_sc_hd.tlef, created 13 layers, 25 vias
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/sky130hd/lef/sky130_fd_sc_hd_merged.lef, created 441 library cells
link_design ALU
read_sdc ./results/sky130hd/ALU/base/1_2_yosys.sdc
source /OpenROAD-flow-scripts/flow/platforms/sky130hd/setRC.tcl
write_db ./results/sky130hd/ALU/base/1_synth.odb
write_sdc -no_timestamp ./results/sky130hd/ALU/base/1_synth.sdc
Elapsed time: 0:01.35[h:]min:sec. CPU time: user 1.23 sys 0.15 (102%). Peak memory: 119884KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
1_synth                            1            117 f8c3c591f3590e4b6c98
